In [1]:
import pandas as pd
l=[
    ["ram",98,"AA"],
    ["raju",89,"AB"],
    ["rohit",99,"AA"],
    ["rahul",87,"AB"],
    ["babu",90,"AC"],
    ["priya",83,"BA"],
    ["ramesh",82,"BB"],
  ]
df=pd.DataFrame(l,columns=["Name","Marks","Grades"])
print(df)

     Name  Marks Grades
0     ram     98     AA
1    raju     89     AB
2   rohit     99     AA
3   rahul     87     AB
4    babu     90     AC
5   priya     83     BA
6  ramesh     82     BB

# loc

In [3]:
df.loc[3:5,"Marks":"Grades"]

   Marks Grades
3     87     AB
4     90     AC
5     83     BA

In [4]:
df.loc[[1,2,3],["Name","Marks"]]

    Name  Marks
1   raju     89
2  rohit     99
3  rahul     87

# iloc

In [5]:
df.iloc[1:3,1:2]

   Marks
1     89
2     99

In [7]:
df.iloc[[1,2,3],[1,2]]

   Marks Grades
1     89     AB
2     99     AA
3     87     AB

In [ ]:
df[df["Name"]=="ram"]["Marks"]

In [13]:
df[df["Name"]=="ram"][["Marks","Grades"]]

   Marks Grades
0     98     AA

In [14]:
df.loc[df["Name"]=="ram",["Marks","Grades"]]

   Marks Grades
0     98     AA

# iat similar like iloc it will fetch set a single value

In [16]:
df.iat[1,1]

89

# at similar like loc it will fetch set a single value

In [17]:
df.at[1,"Name"]

'raju'

Boolean Array size must be the same as your DataFrame
This concept is very useful in filtering the data frame

In [19]:
df.loc[[True,False,True,False,True,False,True],[True,False,True]]

     Name Grades
0     ram     AA
2   rohit     AA
4    babu     AC
6  ramesh     BB

In [20]:
df.iloc[[True,False,True,False,True,False,True],[True,False,True]]

     Name Grades
0     ram     AA
2   rohit     AA
4    babu     AC
6  ramesh     BB

# Practise

In [21]:
import pandas as pd
l=[
    ["ram",98,"AA"],
    ["raju",89,"AB"],
    ["rohit",99,"AA"],
    ["rahul",87,"AB"],
    ["babu",90,"AC"],
    ["priya",83,"BA"],
    ["ramesh",82,"BB"],
  ]
df=pd.DataFrame(l,columns=["Name","Marks","Grades"])
print(df)

     Name  Marks Grades
0     ram     98     AA
1    raju     89     AB
2   rohit     99     AA
3   rahul     87     AB
4    babu     90     AC
5   priya     83     BA
6  ramesh     82     BB

# 1.Students having marks greter than 90

In [24]:
df.loc[df["Marks"]>90]

    Name  Marks Grades
0    ram     98     AA
2  rohit     99     AA

# 2.Students having "AB" grade

In [27]:
df.loc[df["Grades"]=="AB"]

    Name  Marks Grades
1   raju     89     AB
3  rahul     87     AB

# 3.Students having Marks greater than 80 and having "AB" Grade

In [29]:
df[(df["Marks"]>80 ) & (df["Grades"]=="AB")]

    Name  Marks Grades
1   raju     89     AB
3  rahul     87     AB

# 4.Name of the students having marks greater than 90

In [32]:
df[df["Marks"]>90]["Name"]

0      ram
2    rohit
Name: Name, dtype: object

# 5.Name of the students having "AB" Grade

In [36]:
df[df["Grades"]=="AB"]["Name"]

1     raju
3    rahul
Name: Name, dtype: object

# 6.Students having marks greater than 90[loc]

In [39]:
df.loc[df["Marks"]>90]

    Name  Marks Grades
0    ram     98     AA
2  rohit     99     AA

# 7.Students having Marks greater than 80 and having "AB" Grade[loc]

In [41]:
df[(df["Marks"]>80 ) & (df["Grades"]=="AB")]

    Name  Marks Grades
1   raju     89     AB
3  rahul     87     AB

# 8.Access a group of rows and columns by integer positions or a boolean array. Students having marks greater than 90 [iloc]

In [42]:
df[df.iloc[:,1]>90]

    Name  Marks Grades
0    ram     98     AA
2  rohit     99     AA

# 9.Students having Marks greater than 80 and having "AB" Grade [iloc]

In [43]:
df[(df.iloc[:,1]) & (df.iloc[:,2]=="AB")]

    Name  Marks Grades
1   raju     89     AB
3  rahul     87     AB

# 10.Name of the students having "AB" Grade[iloc]

In [44]:
df[df.iloc[:,2]=="AB"]["Name"]

1     raju
3    rahul
Name: Name, dtype: object